//Дано число из отрезка [10, 99]. Показать наибольшую цифру числа

// Console.WriteLine("Введите число от 10 до 99");
// string a = Console.ReadLine();
// if (a[0]>a[1])
// {
//     Console.WriteLine("Наибольшая цифра  " + a[0]);
// } 
// else
// {
//     Console.WriteLine("Наибольшая цифра  " + a[1]);
// }
    
// Console.WriteLine("Введите число");
// string a = Console.ReadLine();
// Console.WriteLine(a[2]);
// if (a<100)
// {
//     Console.WriteLine("Третья цифра отсутствует");
// }
//Определить номер четверти плоскости, в которой находится точка с координатами Х и У, причем X ≠ 0 и Y ≠ 0
//6. Выяснить является ли число чётным

// Console.WriteLine ("Введите число");
// int a = 
// Convert.ToInt32(Console.ReadLine());
//  if ( a % 2 == 0)
//  {
//  Console.WriteLine ($"{a} четное число");
//  }
// else Console.WriteLine ($"{a} не четное");

//Показать последнюю цифру трёхзначного числа

//Вывести квадрат числа
int namber(int a)
{
    int rezalt = a*a;
    return rezalt;
}
                
Console.WriteLine(namber(344));
